video-games/app/controllers/tournaments_controller.rb

SELECT "tournaments".* FROM "tournaments"
---
  def list
    tournaments = Tournament.all

INSERT INTO "tournaments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Torneo 1"], ["created_at", "2015-11-30 15:25:43.447922"], ["updated_at", "2015-11-30 15:25:43.447922"]]
---
  def create
    tournament = Tournament.create tournament_params

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "tournaments" WHERE "tournaments"."id" = ?  [["id", 3]]
---
  def destroy
    tournament = Tournament.find(params[:id])
    id = params[:id]
    if tournament
      tournament.destroy